// Gallery Section //

const data6 = [
    {
        imgSrc:
            "https://static.just.edu.bd/images/public/gallery/1611033368314_1200.jpeg",
        alt: `রাজশাহী বিশ্ববিদ্যালয়ে অনুষ্ঠিত বঙ্গবন্ধু আন্তঃবিশ্ববিদ্যালয় ব্যাডমিন্টন প্রতিযোগিতা ২০২০-২১ এ চ্যাম্পিয়ন ট্রফি যশোর বিজ্ঞান ও প্রযুক্তি বিশ্ববিদ্যালয়ের মাননীয় উপাচার্য অধ্যাপক ড. মোঃ আনোয়ার হোসেনের নিকট তুলে দেন বিজয়ী খেলোয়াড়, কোচ ও ম্যানেজার। `,
        description: ` রাজশাহী বিশ্ববিদ্যালয়ে অনুষ্ঠিত বঙ্গবন্ধু আন্তঃবিশ্ববিদ্যালয়
        ব্যাডমিন্টন প্রতিযোগিতা ২০২০-২১ এ চ্যাম্পিয়ন ট্রফি যশোর বিজ্ঞান
        ও প্রযুক্তি বিশ্ববিদ্যালয়ের মাননীয় উপাচার্য অধ্যাপক ড. মোঃ
        আনোয়ার হোসেনের নিকট তুলে দেন বিজয়ী খেলোয়াড়, কোচ ও ম্যানেজার।`,
    },
    {
        imgSrc:
            "https://static.just.edu.bd/images/public/gallery/1611033327761_1200.jpeg",
        alt: `বঙ্গবন্ধু আন্তঃবিশ্ববিদ্যালয় স্পোর্টস চ্যাম্পস্-২০১৯ এর পদকপ্রাপ্ত খেলোয়াড়গণ যবিপ্রবির উপাচার্য অধ্যাপক ড. মোঃ আনোয়ার হোসেনের নিকট চ্যাম্পিয়ন ট্রফি তুলে দেন। `,
        description: ` বঙ্গবন্ধু আন্তঃবিশ্ববিদ্যালয় স্পোর্টস চ্যাম্পস্-২০১৯ এর
        পদকপ্রাপ্ত খেলোয়াড়গণ যবিপ্রবির উপাচার্য অধ্যাপক ড. মোঃ আনোয়ার
        হোসেনের নিকট চ্যাম্পিয়ন ট্রফি তুলে দেন।`,
    },
    {
        imgSrc:
            "https://static.just.edu.bd/images/public/gallery/1611033327761_1200.jpeg",
        alt: `বঙ্গবন্ধু আন্তঃবিশ্ববিদ্যালয় স্পোর্টস চ্যাম্পস্-২০১৯ এর পদকপ্রাপ্ত খেলোয়াড়গণ যবিপ্রবির উপাচার্য অধ্যাপক ড. মোঃ আনোয়ার হোসেনের নিকট চ্যাম্পিয়ন ট্রফি তুলে দেন। `,
        description: ` বঙ্গবন্ধু আন্তঃবিশ্ববিদ্যালয় স্পোর্টস চ্যাম্পস্-২০১৯ এর
        পদকপ্রাপ্ত খেলোয়াড়গণ যবিপ্রবির উপাচার্য অধ্যাপক ড. মোঃ আনোয়ার
        হোসেনের নিকট চ্যাম্পিয়ন ট্রফি তুলে দেন।`,
    },
    {
        imgSrc:
            "https://static.just.edu.bd/images/public/gallery/1611033327761_1200.jpeg",
        alt: `বঙ্গবন্ধু আন্তঃবিশ্ববিদ্যালয় স্পোর্টস চ্যাম্পস্-২০১৯ এর পদকপ্রাপ্ত খেলোয়াড়গণ যবিপ্রবির উপাচার্য অধ্যাপক ড. মোঃ আনোয়ার হোসেনের নিকট চ্যাম্পিয়ন ট্রফি তুলে দেন। `,
        description: ` বঙ্গবন্ধু আন্তঃবিশ্ববিদ্যালয় স্পোর্টস চ্যাম্পস্-২০১৯ এর
        পদকপ্রাপ্ত খেলোয়াড়গণ যবিপ্রবির উপাচার্য অধ্যাপক ড. মোঃ আনোয়ার
        হোসেনের নিকট চ্যাম্পিয়ন ট্রফি তুলে দেন।`,
    },
    {
        imgSrc:
            "https://static.just.edu.bd/images/public/gallery/1611033327761_1200.jpeg",
        alt: `বঙ্গবন্ধু আন্তঃবিশ্ববিদ্যালয় স্পোর্টস চ্যাম্পস্-২০১৯ এর পদকপ্রাপ্ত খেলোয়াড়গণ যবিপ্রবির উপাচার্য অধ্যাপক ড. মোঃ আনোয়ার হোসেনের নিকট চ্যাম্পিয়ন ট্রফি তুলে দেন। `,
        description: ` বঙ্গবন্ধু আন্তঃবিশ্ববিদ্যালয় স্পোর্টস চ্যাম্পস্-২০১৯ এর
        পদকপ্রাপ্ত খেলোয়াড়গণ যবিপ্রবির উপাচার্য অধ্যাপক ড. মোঃ আনোয়ার
        হোসেনের নিকট চ্যাম্পিয়ন ট্রফি তুলে দেন।`,
    },
    {
        imgSrc:
            "https://static.just.edu.bd/images/public/gallery/1611033327761_1200.jpeg",
        alt: `বঙ্গবন্ধু আন্তঃবিশ্ববিদ্যালয় স্পোর্টস চ্যাম্পস্-২০১৯ এর পদকপ্রাপ্ত খেলোয়াড়গণ যবিপ্রবির উপাচার্য অধ্যাপক ড. মোঃ আনোয়ার হোসেনের নিকট চ্যাম্পিয়ন ট্রফি তুলে দেন। `,
        description: ` বঙ্গবন্ধু আন্তঃবিশ্ববিদ্যালয় স্পোর্টস চ্যাম্পস্-২০১৯ এর
        পদকপ্রাপ্ত খেলোয়াড়গণ যবিপ্রবির উপাচার্য অধ্যাপক ড. মোঃ আনোয়ার
        হোসেনের নিকট চ্যাম্পিয়ন ট্রফি তুলে দেন।`,
    },
    {
        imgSrc:
            "https://static.just.edu.bd/images/public/gallery/1611033327761_1200.jpeg",
        alt: `বঙ্গবন্ধু আন্তঃবিশ্ববিদ্যালয় স্পোর্টস চ্যাম্পস্-২০১৯ এর পদকপ্রাপ্ত খেলোয়াড়গণ যবিপ্রবির উপাচার্য অধ্যাপক ড. মোঃ আনোয়ার হোসেনের নিকট চ্যাম্পিয়ন ট্রফি তুলে দেন। `,
        description: ` বঙ্গবন্ধু আন্তঃবিশ্ববিদ্যালয় স্পোর্টস চ্যাম্পস্-২০১৯ এর
        পদকপ্রাপ্ত খেলোয়াড়গণ যবিপ্রবির উপাচার্য অধ্যাপক ড. মোঃ আনোয়ার
        হোসেনের নিকট চ্যাম্পিয়ন ট্রফি তুলে দেন।`,
    },
    {
        imgSrc:
            "https://static.just.edu.bd/images/public/gallery/1611033327761_1200.jpeg",
        alt: `বঙ্গবন্ধু আন্তঃবিশ্ববিদ্যালয় স্পোর্টস চ্যাম্পস্-২০১৯ এর পদকপ্রাপ্ত খেলোয়াড়গণ যবিপ্রবির উপাচার্য অধ্যাপক ড. মোঃ আনোয়ার হোসেনের নিকট চ্যাম্পিয়ন ট্রফি তুলে দেন। `,
        description: ` বঙ্গবন্ধু আন্তঃবিশ্ববিদ্যালয় স্পোর্টস চ্যাম্পস্-২০১৯ এর
        পদকপ্রাপ্ত খেলোয়াড়গণ যবিপ্রবির উপাচার্য অধ্যাপক ড. মোঃ আনোয়ার
        হোসেনের নিকট চ্যাম্পিয়ন ট্রফি তুলে দেন।`,
    },
];
const galleryDiv = document.querySelector(".gallery__content");

const template = function (data, html, push_div) {
    let news = data.map(function (items) {
        return html(items);
    });

    news = news.join("");
    push_div.innerHTML = news;
};

let gallery = function (items) {
    return `  <div data-v-05e4ad5f="" class="gallery__card">
    <img
        data-v-05e4ad5f=""
        src=${items.imgSrc}
        alt=${items.alt}
        class="gallery__card__img"
    />
    <div data-v-05e4ad5f="" class="gallery__card__caption">
        <p data-v-05e4ad5f="" class="paragraph mb-m-mob">
           ${items.description}
        </p>
    </div>
</div>`;
};

template(data6, gallery, galleryDiv);
